Revit 2026 API

# ProjectLocationSetErase Method

---

Removes a specified project location from the set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	ProjectLocation item
)
```
```vb
Public Overridable Function Erase (
	item As ProjectLocation
) As Integer
```
```cpp
public:
virtual int Erase(
	ProjectLocation^ item
)
```
```fsharp
abstract Erase :
        item : ProjectLocation -> int
override Erase :
        item : ProjectLocation -> int
```

#### Parameters

item ProjectLocation
    The project location to be erased.

#### Return Value

Int32The number of project locations that were erased from the set.

#### Reference

ProjectLocationSet Class

Autodesk.Revit.DB Namespace